Revit 2024 API
LineLoad.Create Method (Document, ElementId, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static LineLoad Create(
	Document document,
	ElementId hostElemId,
	int curveIndex,
	XYZ forceVector1,
	XYZ momentVector1,
	LineLoadType symbol
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	hostElemId As ElementId, _
	curveIndex As Integer, _
	forceVector1 As XYZ, _
	momentVector1 As XYZ, _
	symbol As LineLoadType _
) As LineLoad
Visual C++
public:
static LineLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	int curveIndex,
	XYZ^ forceVector1,
	XYZ^ momentVector1,
	LineLoadType^ symbol
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document to which new line load will be added.
hostElemId
Type: Autodesk.Revit.DB.ElementId
 The analytical host element for the line Load.
curveIndex
Type: System.Int32
 The index of a curve in analytical surface element starting from 0. Use [!:Autodesk::Revit::DB::Structure::AnalyticalSurfaceBase::GetOuterContour] method to obtain appropriate curve index. Curve index has a unique value in analytical element. The index should be obtain by iteration through all curves in all loops.
forceVector1
Type: Autodesk.Revit.DB.XYZ
 The applied 3d force vector.
momentVector1
Type: Autodesk.Revit.DB.XYZ
 The applied 3d moment vector.
symbol
Type: Autodesk.Revit.DB.Structure.LineLoadType
 The symbol of the LineLoad. Set null to use default type.
Return Value
 If successful, returns the newly created LineLoad, null otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element hostElemId does not exist in the document -or- hostElemId is not permitted for this type of load.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentsInconsistentException |  Thrown when all force and moment vectors are equal zero.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if type could not be set for newly created line load.
See Also
LineLoad Class
Create Overload
Autodesk.Revit.DB.Structure Namespace